Revit 2027 API
TargetHostEdgeAndTransform.GetTargetHostEdge Method
 Gets the target host edge.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Edge GetTargetHostEdge()
Public Function GetTargetHostEdge As Edge
public:
Edge^ GetTargetHostEdge()
member GetTargetHostEdge : unit -> Edge
Return Value
Edge
 Returns the target host edge.
See Also
Reference
TargetHostEdgeAndTransform Class
Autodesk.Revit.DB.Structure Namespace